{"0":"Video ProducerMountain ViewContentContract\/TemporaryApply for this jobJoin one of the most exciting companies in Silicon Valley that is poised to disrupt the way we live our daily lives.  Named CNBC's Top 50 Disruptors and on its way to becoming the brand for the way we learn to get jobs, Udacity is looking for people to join its Content team to have a 10X impact on the world.  If you love a challenge, can take risks and truly want to make a difference, read on.At Udacity, our mission is to democratize education.  We aim to bring accessible, affordable, engaging, and highly relevant higher education to the world. We believe that education is no longer limited to four years or four walls, it’s a lifelong pursuit. Technology is advancing rapidly, and there is a growing skills gap between job-seekers and career opportunities that Udacity is dedicated to closing through education. To do this, we're rethinking how education is made and delivered by empowering our students to advance themselves personally and professionally, and help them land their dream job.As a video producer, you will be responsible for driving course content projects forward from ideation to upload. The right candidate will thrive in fast-paced, creative environments, where giving and receiving candid feedback is a must. They’ll enjoy rapid iteration, the challenge inherent in tight deadlines, and the space to take creative risks. A successful producer will take direction well but also have sound editorial judgement and the confidence to move forward independently, and is someone who constantly seeks opportunities to improve their technical and creative abilities, learns well from failure, and isn’t afraid to ask questions.Responsibilities:Leading video projects from concept to upload with minimal oversightBrainstorming approaches to course content with cross functional teamsIndependently planning and executing moderately complex shootsIngesting, organizing, editing, and exporting mediaGiving and receiving constructive feedback in a team settingWorking collaboratively with the rest of the production team to continuously raise the bar in terms of production valueQualifications:A minimum of 4 years of video production and post-production experience in a professional environment Proficiency with the Adobe suite, especially AfterEffects & Premiere Strong production skills, including multi-cam set ups, 3-point lighting, and studio and on-location soundDemonstrated knowledge of how preproduction decisions impact projects in production and post and experience leading cross functional teams through the creative processPluses: Experience with online learningHistory of successful cross-team collaborationIntermediate to advanced motion graphics skillsTo apply, please submit:Your resume or cvReels showing production and post-production skills A cover letter expressing why you're interested in working with Udacity’s production team.  We are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.Apply for this job","1":"Senior Software EngineerMountain View or San FranciscoEngineeringFull-timeApply for this jobJoin one of the most exciting companies in Silicon Valley that is poised to disrupt the way we live our daily lives.  Named CNBC's Top 50 Disruptors and on its way to becoming the brand for the way we learn to get jobs, Udacity is looking for people to join its Engineer team to have a 10X impact on the world.  If you love a challenge, can take risks and truly want to make a difference, read on.At Udacity, we bring high quality education and new employment opportunities to the world at large scale. Billions of people worldwide are actively looking for ways to improve their lives and to grow their skills. We believe that education is no longer limited to four years or four walls, it’s a lifelong pursuit. Technology is advancing rapidly, and there is a growing skills gap between job-seekers, and career opportunities that Udacity is dedicated to closing through education. To do this, we’re rethinking how education is made and delivered by empowering our students to advance themselves personally and professionally, and help them land their dream job.As a Senior Software Engineer on our fast moving Engineering team, you become an integral part of our mission. You help us design, build and launch scalable systems for the next phase of growth and impact. In this specific role, you will be the technical lead for a new, important initiative at Udacity where you will have direct and meaningful impact on individuals’ lives.Your Responsibilities:Lead several fast moving, small engineering teams to deliver excellent mobile apps and web experiencesSet the technical direction for development tools, processes, technical reviews, etc.Work closely with our product and design leadsYour Skills and Experience:Excellent coder and technical leadProficient in state-of-the-art mobile and web technology stacks and development toolsComfortable with making big technical decisionsHands-on attitude to jump in and get things done where neededGreat communicatorBonus: Experience in building and staffing new technical teamsBonus: Experience with distributed teamsWe are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.Apply for this job","2":"Mentorship - Ops LeadMountain View or San FranciscoStudent ServicesFull TimeApply for this jobJoin one of the most exciting companies in Silicon Valley that is poised to disrupt the way we live our daily lives.  Named CNBC's Top 50 Disruptors and on its way to becoming the brand for the way we learn to get jobs, Udacity is looking for people to join its Engineering team to have a 10X impact on the world.  If you love a challenge, can take risks and truly want to make a difference, read on.Our mission is to democratize education.  We aim to bring accessible, affordable, engaging, and highly relevant higher education to the world. We believe that education is no longer limited to four years or four walls, it’s a lifelong pursuit. Technology is advancing rapidly, and there is a growing skills gap between job-seekers and career opportunities that Udacity is dedicated to closing through education. To do this, we're rethinking how education is made and delivered by empowering our students to advance themselves personally and professionally, and help them land their dream job.At Udacity, our students come first. We are building a global network of Mentors who can advise students during their learning experience, helping them set and stick to goals. As a program manager, you will coordinate between Udacity Mentors, our students, product and engineering teams to ensure student success. You will be working on a team to scale the global Mentor community while maintaining quality feedback to our students. You will help organize training, provide strategic direction to optimize operations, analyze payment structures and create helpful career resources for the community. You will also contribute to the student experience by responding to email inquiries from students in an empathetic, timely, and precise manner. If you are solution driven, people focused, and are looking for an opportunity to make an impact, we are looking for you.Technical:You have a strong data background, and are comfortable with data analysis using SQL. You are comfortable using and managing data to drive decisions.Provide strategic direction for the product operations and developing and codifying workflows that support both students and Mentors with various tools (Zendesk, Google docs, etc.) and have the savviness to learn new technologies and tools. Students Facing:You will ensure high graduation and student satisfaction rate. You will act as the escalation point for students and Udacity Mentors when they have concerns and suggestions.You are empathetic and a great listener.You excel in both written and verbal communication. You are a great mediator.You are an enthusiastic problem solver. You are a strong advocate for Udacity students.Other Qualities:You are able to work independently as well as in cross-functional teams. (eg. Product, Engineering) and efficiently to get things done. You guide internal teams on product prioritization based on community feedback.You have strong organizational skills and are comfortable with deadlines.You are passionate about learning and can learn quickly.You are passionate about scaling operations and growing with a global team.Skills\/Qualifications: SQL, Data analysis, Customer Service, Product Knowledge, Quality Focus, Problem Solving, Documentation Skills, Communication, Resolving Conflict, Analyzing Information, Multitasking.We are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.Apply for this job","3":"Sr. Product DesignerMountain View or San FranciscoDesignFull TimeApply for this jobAs a Sr. Product Designer, you will be joining a strong group of designers entrusted with the development of a world class product. You are a motivated designer with a love of solving complex problems with simple and efficient design. Your background and experience in the latest principles of modern interaction and visual design will help to shape the product experience and contribute to the Udacity Design culture. As a design group, we’re looking for someone who is dynamic and fun to work with, you are a self-starter and is not afraid to share your thoughts and opinions. You find delight in innovative design experiences: you stop in the street to look at exciting designs, you tell your friends about quirky new apps. You have a passion for innovation in education and online learning.Responsibilities:Play a key role in growing the design team and establishing the design culture within the companyDevelop and grow a cohesive aesthetic vision for the brand and productsCraft beautiful, engaging experiences that users will loveAmong other areas, be instrumental in driving design and interactions for our mobile initiativesCommunicate effectively through wireframes, mockups, and prototypesWork collaboratively with Product Management, Engineering and ContentDrive products and features from concepts to fruitionShowcase strong design thinking proven through user research, data and design iterations.Works well individually and within a team environment.Productively and proactively contribute to a feedback culture that consistently strives to exceed quality objectivesRequirements:At least 3 years industry experience in designing web products and services, having executed both interaction and visual designDegree or equivalent experience in Human Computer Interaction, Design, Visual Design, Cognitive Science, Computer ScienceStrong product design sensibilities and instincts with an orientation toward using insights about users to inform product design and directionKeen sense for user flow: creating a simple experience, moving people through an experience, focusing users on key use cases, influencing user behaviorAbility to prototype interactive experiencesExcellent written, communication, & documentation skillsObsessive attention to detail and works well under pressure Experience with digital design applications such as Sketch, Illustrator, Photoshop,, Invision, Zeplin, KeynoteFluent in modern (responsive design) web standardsKnowledge of HTML, CSS, Javascript, etc. a plusWe are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.Apply for this job","4":"Design ManagerMountain View or San FranciscoDesignFull-timeApply for this jobJoin one of the most exciting companies in Silicon Valley that is poised to disrupt the way we live our daily lives.  Named CNBC's Top 50 Disruptors and on its way to becoming the brand for the way we learn to get jobs, Udacity is looking for people to join its Design team to have a 10X impact on the world.  If you love a challenge, can take risks and truly want to make a difference, read on.Udacity Design is looking for an inspirational Design Manager that is interested in taking the reins of a strong, motivated group of designers. As a Design Manager you would spearhead the evolution of the Udacity brand identity by providing oversight and guidance to the design group while also rolling up your sleeves to lead specific projects and efforts. You would represent and advocate for great design with leadership and work closely with the Sr. Design Producer to manage the overall health, well-being and career development of the design group. As a design group, we’re looking for someone who is dynamic and fun to work with, you are a self-starter and is not afraid to share your thoughts and opinions. You find delight in innovative design experiences: you stop in the street to look at exciting designs for creative inspiration, you tell your friends  about quirky new apps. You have a passion for innovation in education and online learning.Responsibilities:Inspire and guide the evolution of the Udacity Design cultureDevelop and grow a cohesive aesthetic vision for the brand and productsLead and\/or contribute to specific projects and initiativesMentor and guide in career development for individual designersOutline and develop a focused User Research plan to support Design Consistently exhibit the highest standards of timeliness, accuracy, and self-managementProductively and proactively contribute to a feedback culture that consistently strives to exceed quality objectivesRequirements:Minimum 5 years explicitly relevant experience, verifiable and demonstrable, experience leading a team of designersMeticulously organized and efficient, able to manage multiple concurrent projects, and consistently meet tight deadlinesKeen sense of user flow: creating a simple experience, moving people through an experience, focusing students on key use cases, influencing user behaviorAble to present ideas effectively to peers and to leadershipExcellent interpersonal skills to manage up and downExcellent written, communication, & documentation skillsObsessive attention to detail and works well under pressureExperience with digital design applications such as Sketch, Illustrator, Photoshop,, Invision, Zeplin, KeynoteFluent in modern (responsive design) web standardsKnowledge of HTML, CSS, Javascript, etc. a plusWe are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.Apply for this job","5":"Brand Communications DesignerMountain View or San FranciscoDesignFull-timeApply for this jobAs a Brand Communications Designer, you will own the development of design assets to support all brand communications across our web, email and social platforms. As a advocate of the design group within the Marketing team, you will be entrusted with the execution of marketing projects while also working closely with product designers to ensure brand consistency and design excellence across our communication channels. You have strong visual\/graphic design experience and can communicate your design thinking and recommendations clearly and effectively. As a design group, we’re looking for someone who is dynamic and fun to work with, you are a self-starter and is not afraid to share your thoughts and opinions. You find delight in innovative design experiences: you stop in the street to look at exciting designs, you tell your friends about quirky new apps. You have a passion for innovation in education and online learning.Responsibilities:Develop and maintain design assets for marketing and productWill work primarily with Marketing leads to support visual production of campaigns and contribute to brand tone and voice.Will also work closely with Design lead and design group to help maintain brand consistency through design critiques and design exercises.Works well individually and within a team environment.Contributes to the evolution of Udacity Design cultureShowcase strong design thinking proven through user research, data and design iterations.Comfortable producing digital and social media assets on sporadic deadlines based on cultural trends, often same-dayCommunicates effectively through wireframes, mockups, and prototypesProductively and proactively contribute to a feedback culture that consistently strives to exceed quality objectivesRequirements:Minimum 2-3 years of design experience at an agency or corporate environment.Able to manage multiple concurrent projects, and consistently meet tight deadlinesStrong visual\/graphics design experience.Strong interpersonal communications skillsExcellent written, communication, & documentation skillsObsessive attention to detail and works well under pressure Experience with digital design applications such as Sketch, Illustrator, Photoshop,, Invision, Zeplin, KeynoteFluent in modern (responsive design) web standardsKnowledge of HTML, CSS, Javascript, etc. a plusWe are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.Apply for this job","6":"Social Media & Content Marketing ManagerMountain View or San FranciscoMarketingFull TimeApply for this jobJoin one of the most exciting companies in Silicon Valley that is poised to disrupt the way we live our daily lives.  Named CNBC's Top 50 Disruptors and on its way to becoming the brand for the way we learn to get jobs, Udacity is looking for people to join its Marketing Team to have a 10X impact on the world.  If you love a challenge, can take risks and truly want to make a difference, read on.Udacity’s mission is to democratize education worldwide, and the Marketing Team plays a central role in bringing Udacity products to the masses and creating awareness for the Udacity brand and products. This role is an opportunity to create, drive and manage marketing programs both big and small. As the Social Media & Content Marketing Manager reporting to the Director of Marketing, you’re both tactical and organized yet extremely creative, an out-of-the-box thinker that can dream up engaging marketing social media and content marketing campaigns (both broad and targeted, digital or otherwise) and simultaneously project-manage them to execution. You will oversee Udacity’s social media properties—including Twitter, Facebook, LinkedIn, Google+, Instagram and Snapchat—and be responsible for all published marketing content on those platforms. You will also work on broad content marketing campaigns, including initiatives like Udacity Talks. You will work both independently, and in tandem with your marketing colleagues, and often as with different teams within the company. You will be involved in everything from social\/campaign strategy, planning, execution, and analysis, and engaging social audiences in customer support on Udacity social channels.In detail, you will:Create and publish high-quality generative content across all Udacity social properties on a daily basis, tailored to each platform to create platform-specific engagement, while supporting brand objectivesMonitor Udacity social properties on a daily basis, engaging proactively and positively at all opportunities with our audiences, and directing to the support team when necessarySupport departmental campaigns\/initiatives when appropriate with robust and integrated contentCreate and manage digital content campaigns both large and small, including processes and priorities for each greater campaign team (when applicable)Manage timelines, project expectations, and budgets, as well as oversee creative assets for campaignsBe a fantastic collaborator with the marketing team and other internal Udacity teams, but are comfortable making key decisions after assessing inputBe a calculated risk-taker. You will learn from successes and failures, and are inspired to keep moving and take creative chancesDrive campaigns that are direct team objectives or hand-offs from the CMO, Director or others within UdacityWe're looking for someone who:5 - 8 years of marketing experience with prior experience managing large marketing programs and initiativesIs forward-looking, flexible, creative, and proactiveIs knowledgeable of both standard marketing programs, practices, terminology and data organization\/reporting via Google AnalyticsUnderstand when to be scrappy and do things that don’t scale, and when to invest in automation and processes that scaleHas the ability to both set strategic direction and execute\/do. Nice-to-have: previous entrepreneurial or startup experienceWe are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.Apply for this job"}